In [8]:
import pandas as pd

In [11]:
%cd "C:\Users\amirb\Documents\School\Spring 21\Data Acq. & Mang"

C:\Users\amirb\Documents\School\Spring 21\Data Acq. & Mang

In [34]:
db = pd.read_csv("school.csv")

In [35]:
db

,Unnamed: 0,The Dark Knight,Forest Gump,Groundhog Day,Argo,The Lion King,Howels Moving Castle
0,Sahar,5,5,3,5,3,2
1,Jill,3,5,2,2,4,3
2,Kiran,4,2,4,3,5,5
3,Emma,4,3,1,3,5,3
4,Julio,3,3,3,1,3,1

In [36]:
db = db.set_index('Unnamed: 0')

In [37]:
db

,The Dark Knight,Forest Gump,Groundhog Day,Argo,The Lion King,Howels Moving Castle
Unnamed: 0,,,,,,
Sahar,5,5,3,5,3,2
Jill,3,5,2,2,4,3
Kiran,4,2,4,3,5,5
Emma,4,3,1,3,5,3
Julio,3,3,3,1,3,1

In [25]:
db

,The Dark Knight,Forest Gump,Groundhog Day,Argo,The Lion King,Howels Moving Castle
Unnamed: 0,,,,,,
Sahar,5,5,3,5,3,2
Jill,3,5,2,2,4,3
Kiran,4,2,4,3,5,5
Emma,4,3,1,3,5,3
Julio,3,3,3,1,3,1

In [38]:
db.rename(columns = {'Unnamed: 0': 'People'}, inplace= True)

In [40]:
db.rename( columns={'Unnamed: 0':'People'}, inplace=True )

In [42]:
db.mean()

The Dark Knight         3.8
Forest Gump             3.6
Groundhog Day           2.6
Argo                    2.8
The Lion King           4.0
Howels Moving Castle    2.8
dtype: float64

In [43]:
db.mean(axis =1)

Unnamed: 0
Sahar    3.833333
Jill     3.166667
Kiran    3.833333
Emma     3.166667
Julio    2.333333
dtype: float64

In [49]:
normalized_df=(db-db.min())/(db.max()-db.min())

In [50]:
normalized_df

,The Dark Knight,Forest Gump,Groundhog Day,Argo,The Lion King,Howels Moving Castle
Unnamed: 0,,,,,,
Sahar,1.0,1.000000,0.666667,1.00,0.0,0.25
Jill,0.0,1.000000,0.333333,0.25,0.5,0.50
Kiran,0.5,0.000000,1.000000,0.50,1.0,1.00
Emma,0.5,0.333333,0.000000,0.50,1.0,0.50
Julio,0.0,0.333333,0.666667,0.00,0.0,0.00

In [46]:
normalized_df.mean()

The Dark Knight         0.400000
Forest Gump             0.533333
Groundhog Day           0.533333
Argo                    0.450000
The Lion King           0.500000
Howels Moving Castle    0.450000
dtype: float64

In [47]:
normalized_df.mean(axis = 1)

Unnamed: 0
Sahar    0.652778
Jill     0.430556
Kiran    0.666667
Emma     0.472222
Julio    0.166667
dtype: float64

### Written Analysis

After Standardizing the data, it is easier to tell a story without having to make users constantly think about the scale in use. By after a range of 0,1, it makes it much more clear which movies are more popular as you can just see what is closer to 1.